from django.db import models
from lifanguser.models import *

# 유저 -> 컴퍼니 -> 프로젝트 -> 프로덕트 -> 카테고리
                    # -> 브랜드 사이트 이름 

# 프로젝트
class Project(models.Model):
    choices = (('타오바오', '타오바오'), ('1688', '1688'), ('알리바바', '알리바바'), ('쇼피', '쇼피'))
    # 타오바오 1688 라자다 알리바바 쇼피
    id = models.AutoField(primary_key=True)
    company = models.ForeignKey(Company, on_delete=models.CASCADE)
    name = models.CharField(max_length=255)
    fake_num = models.IntegerField(verbose_name='가품발견수')
    site_name = models.CharField('사이트 이름', max_length=255, choices=choices)
    created_at = models.DateTimeField(auto_now_add=True)
    updated_at = models.DateTimeField(auto_now=True)
    
    def __str__(self):
        return self.name
    
    class Meta:
        db_table = 'project'

# 상품
class Product(models.Model):
    choices =   ('패션의류잡화', (
                    (1, '남성패션'),
                    (2, '베이비 의류/신발/잡화(~24개월)'),
                    (3, '여성패션'),
                    (4, '영유아동 신발/잡화/기타의류(0~17세)'),
                    (5, '유니섹스/남녀공용 패션'),
                    (6, '주니어 의류(9~17세)'),
                    (7, '키즈 의류(3~8세)'),
                )), ('뷰티', (
                    (8,'남성화장품'),
                    (9,'네일'),
                    (10,'메이크업'),
                    (11,'바디'),
                    (12,'뷰티소품'),
                    (13,'선물세트'),
                    (14,'스킨'),
                    (15,'어린이화장품'),
                    (16,'임산부화장품'),
                    (17,'향수'),
                    (18,'헤어'),
                )), ('출산/유아동', (
                    (19, '기저귀/교체용품'),
                    (20, '놀이매트/안전용품'),
                    (21, '분유/유아식품'),
                    (22, '수유/이유용품'),
                    (23, '외출용품'),
                    (24, '유아가구/인테리어'),
                    (25, '유아동침구'),
                    (26, '유아목욕/스킨케어'),
                    (27, '유아물티슈/캡/홀더'),
                    (28, '유아위생/건강/세제'),
                    (29, '이유/유아식기'),
                    (30, '임부용품'),
                    (31, '출산준비물/선물'),
                )), ('식품', (
                    (32, '가공/즉석식품'),
                    (33, '가루/조미료/향신료'),
                    (34, '건강식품'),
                    (35, '냉장/냉동식품'),
                    (36, '생수/음료'),
                    (37, '스낵/간식'),
                    (38, '신선식품'),
                    (39, '유제품/아이스크림/디저트'),
                    (40, '장/소스'),
                    (41, '전통주'),
                    (42, '커피/차'),
                )), ('주방용품', (
                    (43, '교자상/밥상/상커버',),
                    (44, '베이킹&포장용품',),
                    (45, '보관/밀폐용기',),
                    (46, '보온/보냉용품',),
                    (47, '수저/컵/식기',),
                    (48, '이유/유아식기',),
                    (49, '제기/제수용품',),
                    (50, '조리용품',),
                    (51, '주방수납/정리',),
                    (52, '주방일회용품',),
                    (53, '주방잡화',),
                    (54, '취사도구',),
                    (55, '칼/가위/도마',),
                    (56, '커피/티/와인',),                    
                )), ('생활용품', (
                    (57, '건강용품',),
                    (58, '공구',),
                    (59, '구강/면도',),
                    (60, '도장용품',),
                    (61, '방충용품',),
                    (62, '방향/탈취/제습/살충',),
                    (63, '배관/건축자재',),
                    (64, '보수용품',),
                    (65, '생리대/성인기저귀',),
                    (66, '생활소품',),
                    (67, '생활잡화',),
                    (68, '성인용품(19)',),
                    (69, '세제',),
                    (70, '세탁용품',),
                    (71, '수납/정리',),
                    (72, '안전용품',),
                    (73, '욕실용품',),
                    (74, '의료/간호용품',),
                    (75, '접착용품',),
                    (76, '조명/전기용품',),
                    (77, '철물',),
                    (78, '청소용품',),
                    (79, '화장지/물티슈',),
                )), ('가구/홈데코', (
                    (80, '가구',),
                    (81, '금고',),
                    (82, '수선/수예도구',),
                    (83, '원예/가드닝',),
                    (84, '인테리어용품',),
                    (85, '인테리어자재',),
                    (86, '침구',),
                    (87, '카페트/매트',),
                    (88, '커튼/침장',),
                    (89, '쿠션/방석',),
                    (90, '패브릭소품/커버',),                    
                )), ('가전/디지털', (
                    (91, 'TV/영상가전',),
                    (92, '계절환경가전',),
                    (93, '냉장고/밥솥/주방가전',),
                    (94, '생활가전',),
                    (95, '음향기기/이어폰/스피커',),
                    (96, '이미용건강가전',),
                    (97, '카메라/캠코더',),
                    (98, '컴퓨터/게임/SW',),
                    (99, '휴대폰/태블릿PC/액세서리',),                    
                )), ('스포츠/레져',(
                    (100, '검도/격투/무술',),
                    (101, '골프',),
                    (102, '구기스포츠',),
                    (103, '기타스포츠',),
                    (104, '낚시',),
                    (105, '등산',),
                    (106, '라켓스포츠',),
                    (107, '발레/댄스/에어로빅',),
                    (108, '수영/수상스포츠',),
                    (109, '스키/겨울스포츠',),
                    (110, '스포츠 신발',),
                    (111, '스포츠 잡화',),
                    (112, '심판용품',),
                    (113, '자전거',),
                    (114, '철인3종경기',),
                    (115, '측정용품',),
                    (116, '캠핑',),
                    (117, '킥보드/스케이트',),
                    (118, '헬스/요가',),                    
                )), ('자동차용품', (
                    (119, 'DIY/공구용품',),
                    (120, '공기청정/방향/탈취',),
                    (121, '램프/배터리/전기',),
                    (122, '매트/시트/쿠션',),
                    (123, '비상/안전/차량가전',),
                    (124, '세차/관리용품',),
                    (125, '실내용품',),
                    (126, '실외용품',),
                    (127, '오일/정비/소모품',),
                    (128, '오토바이용품',),
                    (129, '차량용디지털기기',),
                    (130, '차량용튜닝용품',),
                    (131, '타이어/휠/체인',),                    
                )), ('도서', (
                    (132, '교육수강권',),
                    (133, '국내도서',),
                    (134, '외국도서',),
                )), ('문구/오피스',(
                    (135, '문구/학용품',),
                    (136, '미술/화방용품',),
                    (137, '사무기기',),
                    (138, '사무용품',),                    
                )), ('음반/DVD',(
                    (139, 'CD/LP',),
                    (140, 'DVD/블루레이',),
                    (141, '굿즈/스타샵',),
                    (142, 'DIY',),                    
                )), ('완구/취미', (
                    (143, 'RC완구/부품',),
                    (144, 'STEAM/학습완구',),
                    (145, '로봇/작동완구',),
                    (146, '마술용품',),
                    (147, '물놀이/계절완구',),
                    (148, '보드게임',),
                    (149, '블록놀이',),
                    (150, '수집품',),
                    (151, '스포츠/야외완구',),
                    (152, '승용완구',),
                    (153, '신생아/영아완구',),
                    (154, '실내대형완구',),
                    (155, '악기/음향기기',),
                    (156, '역할놀이',),
                    (157, '인형',),
                    (158, '퍼즐/큐브/피젯토이',),
                    (159, '프라모델',),
                    (160, '피규어/다이캐스트',),                    
                )), ('반려/애완용품', (
                    (161, '가축사료/용품',),
                    (162, '강아지 사료/간식/영양제',),
                    (163, '강아지/고양이 겸용',),
                    (164, '강아지용품',),
                    (165, '거북이/달팽이용품',),
                    (166, '고슴도치용품',),
                    (167, '고양이 사료/간식/영양제',),
                    (168, '고양이용품',),
                    (169, '관상어용품',),
                    (170, '장수풍뎅이/곤충용품',),
                    (171, '조류용품',),
                    (172, '파충류용품',),
                    (173, '페럿용품',),
                    (174, '햄스터/토끼/기니피그',),                    
                )),
    
    id = models.AutoField(primary_key=True)
    image = models.ImageField(max_length=255, upload_to='images/')
    project = models.ForeignKey(Project, on_delete=models.CASCADE)
    category = models.SmallIntegerField(choices=choices, default=1)
    brand_name = models.CharField(max_length=256, verbose_name='브랜드명', null=True, default='')
    name = models.CharField(max_length=256, verbose_name='상품명', null=True,default='')
    price = models.IntegerField(verbose_name='상품가격')
    url = models.URLField(max_length=255)
    # descrtiption = models.TextField(verbose_name='상품설명')
    created_at = models.DateTimeField(auto_now_add=True) # 등록날짜
    updated_at = models.DateTimeField(auto_now=True) # 수정날짜
    
    def __str__(self):
        return self.name
    
    class Meta:
        db_table = 'product'
        verbose_name = '상품'
        verbose_name_plural = '상품'
        














